БСП_2_4_5/src/Documents/_ДемоРасходныйКассовыйОрдер/_ДемоРасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ДемоРасходныйКассовыйОрдер</name>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef._ДемоКассыККМ</types>
      <types>CatalogRef._ДемоКассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef._ДемоХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef._ДемоФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выдать</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

БСП_2_4_5/src/Enums/_ДемоХозяйственныеОперации/_ДемоХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>_ДемоХозяйственныеОперации</name>
  <comment>Пример использования подсистемы &quot;Управление доступом&quot;, когда доступ ограничивается по внутреннему типу документа (объекта)</comment>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПодотчетника</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗарплаты</name>
  </enumValues>
</mdclass:Enum>

БСП_2_4_5/src/Documents/_ДемоРасходныйКассовыйОрдер/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ВыдачаСредствПодотчетнику";
	КомандаПечати.Представление = НСтр("ru = 'Выдача средств подотчетнику'");
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ХозяйственнаяОперация",
		Перечисления._ДемоХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику);
	
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ВыдачаЗарплаты";
	КомандаПечати.Представление = НСтр("ru = 'Выдача зарплаты'");
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ХозяйственнаяОперация",
		Перечисления._ДемоХозяйственныеОперации.ВыдачаЗарплаты);
		
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ВыдачаСредствПодотчетнику");
	Если ПечатнаяФорма <> Неопределено Тогда
		ТабличныйДокумент = Новый ТабличныйДокумент;
		Область = ТабличныйДокумент.Область(1, 1, 1, 1);
		Область.Текст = НСтр("ru = 'Демонстрация динамической видимости команд печати. Печатная форма ""Выдача средств подотчетнику"".'");
		ПечатнаяФорма.ТабличныйДокумент = ТабличныйДокумент;
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ВыдачаЗарплаты");
	Если ПечатнаяФорма <> Неопределено Тогда
		ТабличныйДокумент = Новый ТабличныйДокумент;
		Область = ТабличныйДокумент.Область(1, 1, 1, 1);
		Область.Текст = НСтр("ru = 'Демонстрация динамической видимости команд печати. Печатная форма ""Выдача зарплаты"".'");
		ПечатнаяФорма.ТабличныйДокумент = ТабличныйДокумент;
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#КонецОбласти

#КонецЕсли
